{
    "list": [
        {
            "recipeId": 1,
            "name": "Dad's Carrot Cake",
            "ingredients": [
                "2 C flaked coconut",
                "2 C sugar",
                "1 1/2 C veg.oil",
                "3 eggs",
                "2 tablespoon vanilla",
                "2 tablespoon of cinnamon",
                "3 eggs",
                "2 1/2 cups of All Purpose Flour",
                "2 tablespoon of baking soda",
                "1 teaspoon of salt",
                "2 cups of shredded carrots",
                "1 8-0z can drained pineapple",
                "1 cup of chopped walnuts (optional)",
                "8 oz softened cream cheese",
                "6 teaspoons of softened sweet butter",
                "3 cups of confectioners sugar",
                "t teaspoon of vanilla",
                "1 teaspoon lemon juice"
            ],
            "directions": [
                "Combine sugar, oil, eggs, and vanilla in a large bowl. Blend with a wooden spoon",
                "Stir in flour, cinnamon, soda, salt and mix",
                "Fold in carrots, cocnut, pineapple, and nuts",
                "Pour into a prepared pan. Bake until tester inserted in center comes out clean (50 minutes)",
                "Let it cool in pan approx 5 minutes. Invert on rack and cool",
                "Cream together slowly for the cream cheese icing. Beat in vanilla and lemon juice"
            ],
            "descr": "DESERTS"
        },
        {
            "recipeId": 2,
            "name": "Pecan Pie",
            "ingredients": [
                "3 cups all-purpose flour",
                "1 teaspoon salt",
                "3/4 cup vegetable shortening/lard",
                "1 egg",
                "1 tablespoon distilled white vinegar",
                "Onion",
                "1 cup of granulated sugar",
                "3 tablespoons brown sugar",
                "1/2 teaspoons of salt",
                "1 teaspoon of vanilla",
                "3 whole eggs beaten",
                "1 cup of chopped peacans"
            ],
            "directions": [
                "First whip up the pie crust: Mix the flour and salt in a bowl. Add the shortening and slated butter. Work the butter into the flour usign a dough cutter until the mixture resembles tiny pebbles",
                "Add the egg, 5 tablespoons cold water and the white vinegar. Stir until just combined. Divide the dough in half and chill until needed. (You will only need one half for this recipe, reserve the other half for another use",
                "Next make the filling: Mix the granulated sugar, brown sugar, salt, corn syrup, butter, vanilla and eggs together in a bowl.",
                "Preheat the oven to 350 degrees F. Roll out one dough half on a lightly floured surface to fit your pie pan. Pour the pecans in the bottom of the unbaked pie shell. Pour the syrup mixture over the top. Cover the top and crust lightly/gently with foil",
                "Bake the pie for 30 minutes. Remove the foil, and then continue baking for 20 minutes, being careful not to burn the crust or pecans. The pie should not be overly jiggly when you remove it from the oven (though it will jiggle a bit). If it shakes a lot, cover with foil and bake for an additional 20 minute or until set. Required baking time seems to vary widely with this recipe. Sometimes it takes 50 minutes, sometimes it takes 75!",
                "Allow to cool for several hours or overnight. Serve in thin slivers."
            ],
            "descr": "DESERTS"
        },
        {
            "recipeId": 3,
            "name": "Stuffed Clams",
            "ingredients": [
                "2 tablespoons olive oil - clams",
                "1 small red onion, coarsely chopped - clams",
                "5 garlic cloves, crushed - clams",
                "1 cup dry white wine - clams",
                "16 littleneck or cherrystone clams (each about 3 inches wide), scrubbed - clams",
                "Seaweed, for serving (optional) - clams",
                "2 tbsps of extra-virgin olive oil - herbed breadcrumb stuffing",
                "1/3 medium white onion, minced - herbed breadcrumb stuffing",
                "2 garlic cloves, minced - herbed breadcrumb stuffing",
                "1/2 cup of almond flour (or finely ground blanched almonds) - herbed breadcrumb stuffing",
                "1 cup fine fresh breadcrumbs - herbed breadcrumb stuffing",
                "1/2 cup cup finely chopped fresh flat-leaf parsleyv",
                "1 tbsp finely chopped fresh dill - herbed breadcrumb stuffing",
                "1 tsp of chopped fresh thyme - herbed breadcrumb stuffing",
                "1/2 teaspoon finely chopped rosemary - herbed breadcrumb stuffing",
                "4 tbsp unsalted butter, softened - herbed breadcrumb stuffing",
                "salt and pepper to taste - herbed breadcrumb stuffing",
                "4 to 6 tbsps of clam broth - herbed breadcrumb stuffing"
            ],
            "directions": [
                "In a small bowl, whisk the mayonnaise with the egg, mustard, Worcestershire sauce and hot sauce until smooth. ",
                "In a medium bowl, lightly toss the crabmeat with the cracker crumbs. Gently fold in the mayonnaise mixture. Cover and refrigerate for at least 1 hour ",
                "Scoop the crab mixture into eight 1/3‐cup mounds; lightly pack into 8 patties, about 1 1/2 inches thick. In a large skillet, heat the oil until shimmering. Add the crab cakes and cook over moderately high heat until deeply golden and heated through, about 3 minutes per side. Transfer the crab cakes to plates and serve with lemon wedges.",
                "Heat olive oil in a pot over medium high. Cook onion until softened but not browned, stirring occasionally, about 5 minutes. Add garlic, and saute, stirring, just until fragrant, about 1 minute. ",
                "Add wine, and bring to a simmer. Add clams, and stir to combine. Cover and steam until clams have opened, 5 to 7 minutes. Remove from heat. Use a slotted spoon to transfer clams to a rimmed baking sheet to cool, discarding any that do not open. Strain clam broth through a fine sieve, and reserve for making stuffing",
                "When clams are cool enough to handle, remove all meat, and reserve. Remove half of each clam shell, and discard. Arrange the remaining halves on a rimmed baking sheet. Cut each clam into ½inch pieces; return pieces to shell. (Clams can be prepared to this point up to 1 day ahead. Cover with plastic wrap and refrigerate",
                "Preheat oven to 350° F. Dividing evenly, press stuffing into clam shells, smoothing with the back of a spoon. Bake until tops are golden, 25 to 30 minutes. Nestle clams on seaweed, if desired, and serve immediately",
                "Heat olive oil in a saute pan. Cook onion and garlic until translucent, stirring frequently, about 5 minutes. Remove from heat and let cool completely",
                "Stir together onion mixture, almond flour, breadcrumbs, herbs and butter in a bowl; season with salt and pepper. Stir in just enough clam broth to moisten stuffing"
            ],
            "descr": "SEAFOOD"
        },
        {
            "recipeId": 4,
            "name": "Stuffed Flounder",
            "ingredients": [
                "6 filets Flounder or Fluke",
                "1/4 cup mayo",
                "1 egg",
                "1/2 cup bread crumbs",
                "1 can lump crab meat",
                "1 can tiny shrimp",
                "1 tsp old bay",
                "salt and pepper",
                "1 lemon",
                "4 tablespoon butter",
                "paprika and parsley for garnish"
            ],
            "directions": [
                "In a bowl, mix together all ingredients, except fish, crab, shrimp and bread crumbs. ",
                "In a separate bowl, add crab and shrimp. Coat with bread crumbs. ",
                "Add in mayo mixture. Add in juice of 1/2 lemon. Mix in parsley.",
                "Butter a casserole dish. Preheat oven to 350 degrees.",
                "Lay the fish flat and add a scoop about a tablespoon size in the center. ",
                "Roll fish up and lay seam side down in the casserole dish. ",
                "In a small bowl, melt 4 tbsp butter. Mix in juice of remaining lemon.",
                "When finished with all fish fillets, brush with melted lemon butter mixture and garnish with paprika",
                "Bake your Crab Stuffed Flounder for 15-20 minutes until the fish is white and flakey"
            ],
            "descr": "SEAFOOD"
        },
        {
            "recipeId": 5,
            "name": "Stuffed Flounder",
            "ingredients": [
                "2 cups broccoli florets",
                "2 cups carrots, sliced",
                "2 tablespoons olive oil",
                "2 teaspoons Kosher salt",
                "2 teaspoons freshly ground black pepper",
                "2 boneless salmon fillets",
                "¾ cup packed brown sugar",
                "3 tablespoons soy sauce",
                "½ cup honey",
                "2 tablespoons sesame seeds"
            ],
            "directions": [
                "Preheat oven to 400°F. ",
                "On a baking sheet, combine broccoli, carrots, oil, salt, and pepper. Mix thoroughly ",
                "Lay Salmon Filets on vegetables",
                "In a medium bowl, combine brown sugar, soy sauce, honey, and sesame seeds. ",
                "Mix until there are no lumps. Spread the glaze evenly on top of the two salmon fillets.Bake for 12 minutes.",
                "Take the salmon fillets off the vegetables and set aside. Toss the vegetables in the roasting juices. Glaze the salmon with any remaining juices. Serve! "
            ],
            "descr": "SEAFOOD"
        },
        {
            "recipeId": 6,
            "name": "Ukoy (Leek/Shrimp Fritters)",
            "ingredients": [
                "Leeks (cut up)",
                "Tempura Batter",
                "Shrimp (cut up)",
                "Vinegar",
                "Garlic",
                "Black ground pepper"
            ],
            "directions": [
                "Heat stove up to high",
                "Fill pan with light caress of oil",
                "Crack 10 eggs and use yolk only",
                "Mix tempura batter with leek and shrimp",
                "take a ladle and place in pan like small pancakes",
                "Cook till golden and crispy on bottom and flip. Cook till golden brown and cooked",
                "Fill small bowl with a 1/4 cup of vinegar",
                "Sprinkle black ground pepper in the vinegar ",
                "Crush some garlic cloves and throw in the mix"
            ],
            "descr": "FILIPINO"
        },
        {
            "recipeId": 7,
            "name": "Chicken Pot Pie",
            "ingredients": [
                "2 pounds cooked boneless, skinless chicken, shredded",
                "Salt",
                "Freshly ground black pepper",
                "4 Tablespoons vegetable oil",
                "4 Tablespoons unsalted butter, at room temperature",
                "4 Tablespoons all purpose flour",
                "1/2 pound red-skinned potatoes, cut into 1/2-inch pieces",
                "1/2 pound carrots, peeled and cut into 1/2-inch pieces",
                "1 medium yellow onion, peeled and diced",
                "2 garlic cloves, minced",
                "Pinch cayenne (optional)",
                "2 cups good-quality canned chicken broth",
                "1-2 Tablespoons heavy cream",
                "1/2 cup shelled fresh peas or frozen peas",
                "Approximately 1/2 pound frozen puff pastry, defrosted following package instructions",
                "1 large egg"
            ],
            "directions": [
                "Melt the butter in a large, tall saucepan. Add flour and whisk to ensure there are no lumps before adding the chicken stock. Cook out this mixture for 5-10 minutes whilecontinuously stirring",
                "Check the consistency by dipping the back of a spoon into the sauce and running your finger along the spoon. You want the sauce to cling to thespoon and not run over the swipe you made.",
                "",
                "Continue to cook and stir the sauce over medium heat until you reach the correct consistency. Season with the salt, pepper, and cayenne (if using). Taste the sauce andsee if your sauce needs more seasoning.",
                "Next, add the cream and stir to combine. Then, add the shredded chicken potatoes, carrots, onion, and garlic to the sauce.Cook the vegetables in the sauce for two to three minutes.",
                "Transfer the filling into a clean bowl and chill in the fridge for one hour, or until cool.",
                "Preheat the oven to 400˚F / 200 ˚C.",
                "Roll out the puff pastry, using a bit of extra flour to ensure the pastry doesn’t stick to your work surface. Use a bowl or plate about an inch larger than the dish you are cooking your pot pie in as a guide to cut out your pastry.",
                "Carefully spoon in your chilled filling into your dish.",
                "Break the egg in a small dish and add a tablespoon of water or cream. Whisk with a fork and brush this egg wash on the edges of your dish. Brush a little of your egg wash on the rim of your dish. Lay your pastry over the top, being careful not to stretch the pastry.",
                "Seal the edges of the pastry by lightly pushing it onto the rim of your dish to make sure it is secure. Then brush the top and sides with more egg wash. Place your pot pies on a large baking sheet and bake for 25-35 minutes",
                "Bake until your pastry is a nice golden, dark brown and there are no more grayish raw patches"
            ],
            "descr": "COMFORT FOOD"
        },
        {
            "recipeId": 8,
            "name": "Breakfeast Strata",
            "ingredients": [
                "1 loaf (1 pound) herb or cheese bakery bread, cubed",
                "1 pound bulk pork sausage",
                "1 medium green pepper, chopped",
                "1 medium onion, chopped",
                "1 cup shredded cheddar cheese",
                "2 teaspoons grated fresh ginger",
                "6 large eggs",
                "2 cups 2% milk"
            ],
            "directions": [
                "Place bread cubes in a greased 13x9-in. baking dish. In a large skillet, cook and crumble sausage with pepper and onion over medium-high heat until no longer pink, 5-7 minutes. With a slotted spoon, place sausage mixture over bread. Sprinkle with cheese.",
                "In a large bowl, whisk together eggs, mustard and milk; pour over top. Refrigerate, covered, overnight.",
                "Preheat oven to 350°. Remove strata from refrigerator while oven heats.",
                "Bake, uncovered, until a knife inserted in center comes out clean, 30-35 minutes. Let stand 5 minutes before cutting."
            ],
            "descr": "BARBEQUE"
        },
        {
            "recipeId": 9,
            "name": "Corned Beef",
            "ingredients": [
                "1 lb baking (russet) potatoes, peeled and cut into 1/4-inch dice",
                "1-lb piece cooked corned beef, cut into chunks",
                "beef, cut into chunks 1 cup chopped onion",
                "1 medium onion, chopped",
                "1 large red bell pepper, cut into 1/4-inch pieces",
                "2 tablespoons unsalted butter",
                "1/4 cup heavy cream",
                "4 large eggs (optional)",
                "1 tbsp chopped fresh flat-leaf parsley"
            ],
            "directions": [
                "Cook potatoes in boiling salted water to cover until just tender, about 3 minutes, then drain. Pulse corned beef in a food processor until coarsely chopped.",
                "Sauté onion and bell pepper in butter in a 12-inch nonstick skillet over moderately high heat, stirring, until lightly browned, about 5 minutes. Add potatoes and sauté over moderately high heat, stirring occasionally, until browned, about 5 minutes.",
                "Stir in corned beef and salt and pepper to taste, then cook, stirring occasionally, until browned. Add cream and cook, stirring, 1 minute.",
                "If desired, make 4 holes in hash and break 1 egg into each. Cook over moderately low heat, covered, 5 minutes, or until eggs are cooked to desired doneness, and season with salt and pepper. Sprinkle hash with parsley."
            ],
            "descr": "BARBEQUE"
        },
        {
            "recipeId": 10,
            "name": "Pan Fried Noodles",
            "ingredients": [
                "Large package of chicken/beef",
                "Shrimp",
                "package of savory tofu",
                "3 eggs",
                "egg noodles",
                "Nature's seasoning",
                "Liquid Tamarin",
                "green onions",
                "onion sprouts"
            ],
            "directions": [
                "Preheat a skillet on high heat with canola oil. Add shredded carrot to the skillet and cook until the carrots soften. Remove from skillet and set aside.",
                "Add sesame oil to the same skillet and fry noodles until they get crispy edges. Add carrots back to the noodles and add in the chopped green onions.",
                "To create the sauce, combine soy sauce together with hoisin sauce and pressed garlic. Add the sauce mixture to the cooking ingredients.",
                "After a few minutes, add bean sprouts and stir to combine everything together. Remove from the heat and serve while everything is still warm."
            ],
            "descr": "ASIAN"
        },
        {
            "recipeId": 11,
            "name": "Pineapple Upside Down Cake",
            "ingredients": [
                "2 2/3 cups (400 g) plain cake flour",
                "2 tbsp (10 g) cocoa powder , unsweetened",
                "1 tsp (5 g) baking soda / bi-carb soda , NOT baking powder (Note 2)",
                "Pinch of salt",
                " 1/2 cup (115 g) unsalted butter ",
                "1 1/2 cups (330 g) caster / superfine white sugar ",
                "2 eggs",
                "1 cup (250ml) vegetable oil",
                "1 tsp white vinegar",
                "2 tsp vanilla extract (or essence)",
                "1 cup (250 ml) buttermilk , at room temperature (Note 4)",
                "2 1/2 tbsp red food colouring liquid (UK: use Gel, Note 7)",
                "g) Philadelphia Cream Cheese, block , softened but not too soft",
                "1/2 cup (115 g) unsalted butter , softened (but not too soft)",
                "1 1/2 tsp vanilla extract",
                "4 cups (450 g) soft icing sugar / powdered sugar"
            ],
            "directions": [
                "Preheat oven to 180C/350F (all oven types). Butter 2 x 21cm / 8″ round cake pans (sides and base) and dust with cocoa powder.",
                "Sift the Dry Ingredients and whisk to combine in a bowl.",
                "Place butter and sugar in a bowl and beat with electric beater or in stand mixer until smooth and well combined (use paddle",
                "Add eggs, one at a time, beating in between to combine. At first it will look curdle – keep beating until it’s smooth.",
                "Add vegetable oil, vinegar, vanilla, buttermilk and red food colouring. Beat until combined and smooth (Note 5).",
                "Add Dry Ingredients. Beat until just combined – some small lumps is ok, that’s better than over mixing.",
                "Divide batter between cake pans. Bake for 25 – 30 minutes on the same shelf, or until a toothpick inserted into the centre comes out clean. (Note 6)",
                "Rest for 10 minutes in the pan then turn out onto a cooling rack and allow to cool."
            ],
            "descr": "American"
        },
        {
            "recipeId": 12,
            "name": "Chicken Parmesan",
            "ingredients": [
                "Large package of ground beef",
                "Medium Onion",
                "2  eggs",
                "4 slices of bread",
                "Nature's seasoning"
            ],
            "directions": [
                "Chop onion",
                "Mix together the grondbeef, eggs, and nature's seasoning",
                "Mix in onion",
                "Cut the bread into small cubes",
                "Mix in the bread",
                "Make meat balls"
            ],
            "descr": "ITALIAN"
        },
        {
            "recipeId": 13,
            "name": "Stuffed Shells",
            "ingredients": [
                "Large package of jumbo pasta shells",
                "Medium Onion",
                "1 egg",
                "Ricotta cheese",
                "Nature's seasoning",
                "2 cans of crushed tomatoes",
                "sugar",
                "salt",
                "pepper",
                "shredded mozarella cheese",
                "spinach",
                "italian seasoning",
                "parmesan cheese"
            ],
            "directions": [
                "Preheat oven to 375 degrees F",
                "Coat a 9 x 13 baking pan with cooking spray",
                "Spread 1 1/2 cups of the marinara sauce in an even layer in the bottom of the pan.",
                "Place the ricotta cheese, 1 1/2 cups of mozzarella cheese, spinach, Italian seasoning, egg, onion, salt, pepper and parmesan cheese in a bowl. Stir to combine.",
                "Spoon the remaining marinara sauce over the shells, then sprinkle the other 1 1/2 cups of cheese over the top.",
                "Cover the dish with foil. Bake for 20 minutes. Uncover the pan, then bake for an additional 10 minutes or until cheese is melted and starting to brown.",
                "Sprinkle with parsley, then serve."
            ],
            "descr": "ITALIAN"
        },
        {
            "recipeId": 14,
            "name": "Creamy Pasta and Crispy Mushrooms",
            "ingredients": [
                "4 Tbsp. extra-virgin olive oil",
                "1 lb. mixed mushrooms ",
                "Salt",
                "2 medium shallots,finely chopped  (garlic/onion substitute)",
                "1lb. spaghettit or bucatini",
                "1/2 cup  heavy cream",
                "1/3 cup finely chopped parsley",
                "Zest and juice of 1/2 lemon",
                "2  Tbsp. unsalted butter, cut into pieces",
                "1/2oz. Parmesan, finely grated (about 1/2 cup), plus more for serving",
                "freshly ground black pepper"
            ],
            "directions": [
                "Heat 2 Tbsp. oil in a large pot over medium-high",
                "Cook half of mushrooms in a single layer, ubdisturbed, until edges are brown and crispy",
                "Give mushrooms a toss and continue to cool, tossing occassionally,  until all sides are brown and crisp, about 5 minutes more",
                "Using a slotted spoon, transfer mushrooms to a plate, season with salt. Repeat with remaining 2 Tbsp oil  and mushrooms and more salt",
                "Reduce heat to medium-low and return all of the mushrooms to the pot. Add  shallots and cool, stirring often, until  shallots are translucent and softened, about 2 minutes",
                "Cook pasta in a pot of boiling and salted water. ",
                "Use tongs to transfer pasta to pot with mushrooms and add cream and 1 cup of pasta cooked water. Increase heat to medium and bring to a simmer",
                "Remove from heat and add lemon zest,lemon juice, parsley, butter, parmesan, and lots of pepper"
            ],
            "descr": "ITALIAN"
        },
        {
            "recipeId": 15,
            "name": "Dad's Marinara",
            "ingredients": [
                "Garlic",
                "Small onion",
                "Can of crushed tomatoes",
                "nature's seasoning",
                "Italian Seasoning",
                "Sugar",
                "Olive Oil"
            ],
            "directions": [
                "Mince several cloves of garlic",
                "Chop small onion",
                "In saucepan, heat up oil",
                "Add garlic and stir for about 10 to 15 seconds",
                "Add onion and allow to cook for abouta minute or two",
                "Pour in crushed tomatoes, rinse can with about 3/4 withwater and pour water in",
                "Add about a teaspoon or so to the pot and mix",
                "Add about  a tablespoon of the Italian seasoning and mix",
                "Add about 3 tablespoons of sugar",
                "Allow to simmer"
            ],
            "descr": "ITALIAN"
        },
        {
            "recipeId": 16,
            "name": "Honey Garlic Pork",
            "ingredients": [
                "2 pork tenderloins",
                "1 1/2 tbsp olive oil",
                "3 garlic cloves",
                "1/2 tsp garlic powder - pork rub",
                "1/2 tsp paprika - pork rub",
                "1/2 tsp salt - pork rub",
                "1/2 tsp black pepper - pork rub",
                "3 tbsp cider vinegar - honey garlic sauce",
                "1 1/2 tbsp soy sauce - honey garlic sauce",
                "1/2 cup of honey - honey garlic sauce"
            ],
            "directions": [
                "Preheat oven to 350 degrees Fahrenheit",
                "Mix sauce ingredients together",
                "Mix rub ingredients and sprinkle over pork",
                "Heat oil in a large oven proff skillet over high heat. Add pork and sear until golden",
                "pour sauce in, turn pork once and then immediately transfer to oven",
                "Roast 15-18 minutes ",
                "Place skillet with sauce on stove over medium high heat, simmer rapidly for 3 minutes until liquid reduces down to thin syrup"
            ],
            "descr": "COMFORT FOOD"
        },
        {
            "recipeId": 17,
            "name": "Honey Garlic Pork",
            "ingredients": [
                "Large package of ground beef",
                "Large Onion",
                "Large green pepper",
                "2 eggs",
                "Oatmeat",
                "Nature's seasoning",
                "can ofcrushed tomatoes"
            ],
            "directions": [
                "Chop onion",
                "Chop green pepper",
                "In mixing bowl place ground beef, half of the chopped onion, half of the chopped green pepper, 2 eggs, nature’s seasoning and mix well",
                "Divide mixture in half and form loaf. Repeat with other half",
                "Place in fry pan and brown all sides",
                "When browning last side, add onions to pan to cook",
                "Add green  pepper and allow to cook for about a minute or two.",
                "Pour crushed tomatoes over loaves",
                "3/4  fill empty can with water, swirl and pour intofry pan",
                "Let simmer for about 45 minutes"
            ],
            "descr": "COMFORT FOOD"
        },
        {
            "recipeId": 18,
            "name": "Meatloaf",
            "ingredients": [
                "Large package of ground beef",
                "Large Onion",
                "Large green pepper",
                "2 eggs",
                "Oatmeat",
                "Nature's seasoning",
                "can ofcrushed tomatoes"
            ],
            "directions": [
                "Chop onion",
                "Chop green pepper",
                "In mixing bowl place ground beef, half of the chopped onion, half of the chopped green pepper, 2 eggs, nature’s seasoning and mix well",
                "Divide mixture in half and form loaf. Repeat with other half",
                "Place in fry pan and brown all sides",
                "When browning last side, add onions to pan to cook",
                "Add green  pepper and allow to cook for about a minute or two.",
                "Pour crushed tomatoes over loaves",
                "3/4  fill empty can with water, swirl and pour intofry pan",
                "Let simmer for about 45 minutes"
            ],
            "descr": "COMFORT FOOD"
        },
        {
            "recipeId": 19,
            "name": "Salisbury Steaks",
            "ingredients": [
                "Ground Beef",
                "Mushrooms",
                "Onion",
                "Brown gravy mix",
                "Nature's Seasoning"
            ],
            "directions": [
                "In mixing bowl, mix ground beef and nature's seasoning",
                "Make meat patties",
                "Place meat patties in frypan and brown sides",
                "After browning first side, place choppedonions into pan while browning the second side",
                "Slice mushrooms",
                "Place brown gravy mix in cup, add water and mix",
                "Place mushrooms on top",
                "Add some nature's seasoning and cover",
                "Allow to simmer"
            ],
            "descr": "COMFORT FOOD"
        },
        {
            "recipeId": 20,
            "name": "Meat Sauce",
            "ingredients": [
                "Ground Beef",
                "Marinara Sauce",
                "Oil",
                "Nature's Seasoning"
            ],
            "directions": [
                "Add 1 lb of ground beef to the marinara sauce to make a meat sauce. Meat sauce allows the meat to go alot further than in making meatballs to add the ground beef, take about a pound for the above amount of sauce and brown it first in a fry pan to remove the oil. Season with nature's seasoning. After meat is browned,  remove the liquid and spoon the meat into the sauce and then stir. "
            ],
            "descr": "COMFORT FOOD"
        },
        {
            "recipeId": 21,
            "name": "Meat Sauce",
            "ingredients": [
                "Ground Beef",
                "Marinara Sauce",
                "Oil",
                "Nature's Seasoning"
            ],
            "directions": [
                "Add 1 lb of ground beef to the marinara sauce to make a meat sauce. Meat sauce allows the meat to go alot further than in making meatballs to add the ground beef, take about a pound for the above amount of sauce and brown it first in a fry pan to remove the oil. Season with nature's seasoning. After meat is browned,  remove the liquid and spoon the meat into the sauce and then stir. "
            ],
            "descr": "BREAKFEAST"
        },
        {
            "recipeId": 22,
            "name": "Meat Sauce",
            "ingredients": [
                "Ground Beef",
                "Marinara Sauce",
                "Oil",
                "Nature's Seasoning"
            ],
            "directions": [
                "Add 1 lb of ground beef to the marinara sauce to make a meat sauce. Meat sauce allows the meat to go alot further than in making meatballs to add the ground beef, take about a pound for the above amount of sauce and brown it first in a fry pan to remove the oil. Season with nature's seasoning. After meat is browned,  remove the liquid and spoon the meat into the sauce and then stir. "
            ],
            "descr": "American"
        },
        {
            "recipeId": 23,
            "name": "Crab Cakes",
            "ingredients": [
                "1/2 cup mayonnaise",
                "1 large egg, beaten",
                "1 tablespoon Dijon mustard",
                "1 tablespoon Worcestershire sauce",
                "1/2 teaspoon hot sauce",
                "1 pound jumbo lump crab meat, picked over",
                "20 saltine crackers, finely crushed",
                "1/4 cup canola oil",
                "lemon wedges, for serving"
            ],
            "directions": [
                "In a small bowl, whisk the mayonnaise with the egg, mustard, Worcestershire sauce and hot sauce until smooth. ",
                "In a medium bowl, lightly toss the crabmeat with the cracker crumbs. Gently fold in the mayonnaise mixture. Cover and refrigerate for at least 1 hour ",
                "Scoop the crab mixture into eight 1/3‐cup mounds; lightly pack into 8 patties, about 1 1/2 inches thick. In a large skillet, heat the oil until shimmering. Add the crab cakes and cook over moderately high heat until deeply golden and heated through, about 3 minutes per side. Transfer the crab cakes to plates and serve with lemon wedges."
            ],
            "descr": "SEAFOOD"
        },
        {
            "recipeId": 24,
            "name": "Chicken Parmesan",
            "ingredients": [
                "2 large eggs - chicken",
                "1 tablespoon minced garlic - chicken ",
                "2 tablespoons fresh chopped parsley - chicken",
                "Salt and pepper to season - chicken",
                "3 large chicken breasts halved horizontally to make 6 fillets - chicken",
                "1 cup Panko breadcrumbs - chicken",
                "1/2 cup breadcrumbs (Italian or golden) - chicken",
                "1/2 cup fresh grated parmesan cheese - chicken",
                "1 teaspoon garlic or onion powder - chicken",
                "1/2 cup olive oil for frying (canola oil/vegetable oil are fine) - chicken ",
                "mozarella cheese - chicken",
                "1 tablespoon olive oil",
                "1 tablespoon minced garlic ",
                "1 large onion chopped",
                "2 cans of crushed tomatoes",
                "3 large chicken breasts halved horizontally to make 6 fillets",
                "sugar"
            ],
            "directions": [
                "Place the flour, 3/4 teaspoon salt, and 1/4 teaspoon pepper in a ziplock bag. Add the chicken to the bag; seal bag tightly and shake to coat chicken evenly. Set aside.",
                "Heat the oil and 2 tablespoons of the butter in a large skillet over medium-high heat. ",
                "Place the flour-dusted chicken in the pan, shaking off any excess first, and cook, turning once, until the chicken is golden and just barely cooked through, about 5 to 6 minutes total.",
                "Transfer the chicken to a plate and set aside.",
                "Melt the remaining tablespoon of butter in the pan. Add the mushrooms and cook, stirring frequently, until the mushrooms begin to brown, 3 to 4 minutes. Add the shallots, garlic, and 1/4 teaspoon of salt; cook for 1 to 2 minutes more.",
                "Add the broth, Marsala, heavy cream, thyme, 1/4 teaspoon salt, and 1/8 teaspoon of pepper; use a wooden spoon to scrape any brown bits from the pan into the liquid. ",
                "Bring the liquid to a boil, then reduce the heat to medium and gently boil, uncovered, until the sauce is reduced by about half, slightly thickened, and darkened in color, 10 to 15 minutes (you’re going for a thin cream sauce; it won’t start to thicken until the very end of the cooking time)",
                "Add the chicken back to the pan, along with any juices that accumulated on the plate. Reduce the heat to low and simmer until the chicken is warmed through and the sauce thickens a bit more, 2 to 3 minutes.",
                "Sprinkle with parsley, if using, and serve.",
                "Preheat oven 430°F | 220°C. Lightly grease an oven tray (or baking dish) with non stick cooking oil spray; set aside.",
                "Whisk together eggs, garlic, parsley, salt and pepper in a shallow dish. Add chicken into the egg, rotating to evenly coat each fillet in the mixture. Cover with plastic wrap and allow to marinate for at least 15 minutes (or overnight night if time allows for a deeper flavour).",
                "When chicken is ready for cooking, mix bread crumbs, Parmesan cheese and garlic powder together in a separate shallow bowl. Dip chicken into the breadcrumb mixture to evenly coat.",
                "Heat oil in a large skillet over medium-high heat until hot and shimmering. Fry chicken until golden and crispy, (about 4-5 minutes each side).",
                "Preheat oven 430°F | 220°C. Lightly grease an oven tray (or baking dish) with non stick cooking oil spray; set aside.",
                "Whisk together eggs, garlic, parsley, salt and pepper in a shallow dish. Add chicken into the egg, rotating to evenly coat each fillet in the mixture. Cover with plastic wrap and allow to marinate for at least 15 minutes (or overnight night if time allows for a deeper flavour).",
                "When chicken is ready for cooking, mix bread crumbs, Parmesan cheese and garlic powder together in a separate shallow bowl. Dip chicken into the breadcrumb mixture to evenly coat.",
                "Heat oil in a large skillet over medium-high heat until hot and shimmering. Fry chicken until golden and crispy, (about 4-5 minutes each side).",
                "Place chicken on prepared baking tray / dish and top each breast with about 1/3 cup of sauce (sauce recipe below). Top each chicken breast with 2-3 slices of mozzarella cheese and about 2 tablespoons parmesan cheese. Sprinkle with basil or parsley. ",
                "Bake for 15-20 minutes, or until cheese is bubbling and melted, and the chicken is completely cooked through. ",
                "Use tongs to transfer pasta to pot with mushrooms and add cream and 1 cup of pasta cooked water. Increase heat to medium and bring to a simmer",
                "Remove from heat and add lemon zest,lemon juice, parsley, butter, parmesan, and lots of pepper"
            ],
            "descr": "ITALIAN"
        },
        {
            "recipeId": 25,
            "name": "Black Eyed Peas and Ham Hocks",
            "ingredients": [
                "Smoked Ham Hocks",
                "Onions",
                "Black eyed peas"
            ],
            "directions": [
                "Rinse off the smoked ham hocks and place them in the slow cooke",
                "Cut onion into quarters and place in the slow cooker",
                "Rinse peas and place them into slow cooker",
                "add enough water to cover ham hocks",
                "add half teaspoon of salt"
            ],
            "descr": "SLOW COOKER"
        },
        {
            "recipeId": 26,
            "name": "Pot Roast",
            "ingredients": [
                "Garlic",
                "Beef chuck roast",
                "Nature's seasoning",
                "Carrots",
                "Potatoes",
                "Green pepper",
                "Onion"
            ],
            "directions": [
                "Mince garlic",
                "Make cuts into beef that do not go all the way through",
                "Place garlic and nature's seasoning into incisions",
                "Peel carrots and potatoes and slice into bite-sized pieces",
                "Slice green pepper into strips",
                "Quarter onion",
                "Set the meat into the slow cooker",
                "Cover with vegetables",
                "Add nature's seasoning",
                "Let simmer on low for about  6 hours"
            ],
            "descr": "SLOW COOKER"
        },
        {
            "recipeId": 27,
            "name": "BBQ Pulled Pork",
            "ingredients": [
                "Boston Butt",
                "Pork rub",
                "BBQ Sauce",
                "Buns"
            ],
            "directions": [
                "Apply generous amount of rub onto butt",
                "Place butt into slow cooker",
                "Set on  low and allow to sit for 6to 8 hours",
                "Take butt out of slow cooker and place into a pan",
                "Using forks, shred the meat off of the bone",
                "Add BBQ sauce"
            ],
            "descr": "SLOW COOKER"
        },
        {
            "recipeId": 28,
            "name": "Stuffed Green Bell Peppers",
            "ingredients": [
                "Ground beef",
                "Green peppers",
                "Onion",
                "Cooked rice",
                "2 eggs",
                "Nature's seasoning",
                "Can of crushed tomatoes"
            ],
            "directions": [
                "Chop onion",
                "Cut tops off the green peppers",
                "Chop the tops of the green peppers",
                "In bowl, mix ground beef, 3/4 chopped onion, 3/4  choppedpepper, eggs and rice",
                "Add some nature's seasoning and mix well",
                "Fill green pepper  bottoms with  mixture. Do not pack tightly",
                "Place stuffed peppers into slow cooker",
                "Add remainder chopped onion and chopped pepper",
                "Add crsuhed tomato",
                "3/4 fill empty crushed tomato can with water and swirl to get the rest of the crushed tomato. Add to slow cooker",
                "Add nature's seasoning",
                "Set on low and allow to simmer 4-6 hours.  On high simmer for  about 3 hours"
            ],
            "descr": "SLOW COOKER"
        },
        {
            "recipeId": 29,
            "name": "Chilaquiles Con Salsa Roja",
            "ingredients": [
                "Beef/Chicken",
                "Onion and diced green chiles",
                "black/pinto beans",
                "Tortillas",
                "Cheese",
                "Fresh Cilantro",
                "sliced avocado",
                "sour cream",
                "Oil and flour - (for tortillas)",
                "Chili Powder - (for tortillas)",
                "garlic powder, ground cumin, and dried oregano - (for tortillas)",
                "Chicken/Vegetable stock - (for tortillas)",
                "Salt - (for tortillas)"
            ],
            "directions": [
                "Cook the roux and spices: In a small saucepan, we’ll first cook the flour and oil together to form the roux, and then whisk in the spices to briefly toast them in the saucepan before adding in the stock.",
                "Simmer: Gradually add in the stock while whisking the sauce, in order to blend in any lumps. Then bring the sauce to a simmer and let it cook (you want to maintain a low bubble) for 10-15 minutes, or until it has reduced to your desired thickness.",
                "Season: Season with salt (or any extra seasonings that you might like to add) to taste.",
                "Serve: Then serve it up in a pan of enchiladas or whatever recipe sounds good…and enjoy!",
                "Prep oven and enchilada sauce. Preheat oven to 350°F.  Prepare your enchilada sauce.",
                "Sauté the filling mixture. In large sauté pan, heat oil over medium-high heat. ",
                "Add onion and sauté for 3 minutes, stirring occasionally. ",
                "Add diced chicken and green chiles, and season with a generous pinch of salt and pepper. ",
                "Sauté the mixture for 6-8 minutes, stirring occasionally, or until the chicken is cooked through. ",
                "Add in the beans and stir until evenly combined.  ",
                "Remove pan from heat and set aside.",
                "Assemble the enchiladas. To assemble the enchiladas, set up an assembly line including: tortillas, enchilada sauce, chicken mixture, and cheese. ",
                "Lay out a tortilla, and spread two tablespoons of sauce over the surface of the tortilla.  ",
                "Add a generous spoonful of the chicken mixture in a line down the center of the tortilla, then sprinkle with 1/3 cup cheese. ",
                "Roll up tortilla and place in a greased 9 x 13-inch baking dish. Assemble the remaining enchiladas.  ",
                "Then spread any remaining sauce evenly over the top of the enchiladas, followed by any extra cheese.",
                "Bake. Bake uncovered for 20 minutes, until the enchiladas are cooked through and the tortillas are slightly crispy on the outside.  Transfer the baking dish to a wire baking rack.",
                "Serve. Serve the enchiladas immediately while they’re nice and hot and melty, garnished with lots of fresh toppings. Enjoy!"
            ],
            "descr": "HISPANIC"
        },
        {
            "recipeId": 30,
            "name": "Fajitas",
            "ingredients": [
                "Beef/Chicken",
                "Two large onions",
                "Two large green peppers",
                "One large red pepper",
                "One large yellow pepper",
                "Limes, lots of limes",
                "Nature's Seasoning",
                "Crushed red pepper flakes",
                "Tortillas"
            ],
            "directions": [
                "Slice meat into thin strips",
                "Sprinkle some crushed red pepper flakes on top of the meat",
                "Squeeze limes over the meat (make sure you drain out the seeds)",
                "Mix well and allow to marinate for about an hour (overnight is best)",
                "Slice the onions and peppers",
                "In a little oil, saute the onions and peppers together for a couple of minutes",
                "Remove from pan",
                "Place pan back on stove and place the strips of meat into the pan to cook",
                "When all the meat is cooked, add in the onions and peppers",
                "Add some nature's seasoning and stir for a minute or two to combine the flavors",
                "Place in tortillas"
            ],
            "descr": "HISPANIC"
        },
        {
            "recipeId": 31,
            "name": "Arroz Caldo",
            "ingredients": [
                "2 tablespoons olive oil ",
                "1 onion, diced",
                "2 cloves garlic, crushed",
                "1 (2 inch) piece fresh ginger, peeled and thinly sliced",
                "2 ¼ pounds chicken wings, split and tips discarded",
                "1 tablespoon fish sauce (Optional)",
                "5 ¼ cups chicken broth",
                "1 cup glutinous sweet rice",
                "salt and pepper to taste",
                "1 green onion, chopped",
                "1 lemon, sliced (Optional)"
            ],
            "directions": [
                "Heat the olive oil in a large pot over medium heat; cook and stir the onion, garlic, and ginger in the hot oil until fragrant, about 5 minutes. Add the chicken wings; cook and stir together for 1 minute. Stir the fish sauce into the pot, cover, and cook another 2 minutes.",
                "Pour the chicken broth into the pot. Add the sweet rice and stir. Bring the mixture to a boil; cover and cook for 10 minutes, stirring occasionally to assure the rice is not sticking to the bottom of the pot. Season with salt and pepper. Garnish with the green onion, and serve with lemon slices and additional fish sauce, if desired."
            ],
            "descr": "FILIPINO"
        },
        {
            "recipeId": 32,
            "name": "Crispy Pata",
            "ingredients": [
                "1 piece whole pig leg cleaned",
                "6 pieces dried bay leaves",
                "2 tablespoons whole peppercorn",
                "4 pieces star anise optional",
                "6 teaspoons salt",
                "2 teaspoons ground black pepper",
                "2 teaspoons garlic powder",
                "12 cups water",
                "6 cups cooking oil"
            ],
            "directions": [
                "Pour water in a cooking pot then let boil.",
                "Put-in dried bay leaves, whole peppercorn, star anise, and 4 teaspoons of salt.",
                "Add the whole pig’s legs in the cooking pot then simmer until the leg becomes tender (about 45 to 60 minutes).",
                "Remove the tender leg from the cooking pot and set aside until the temperature goes down.",
                "Rub the leg with garlic powder, ground black pepper, and remaining salt. Let stand for 15 minutes to absorb the rub.",
                "Heat a clean large cooking pot (preferably with cover) and pour-in cooking oil.",
                "When the oil becomes hot, deep fry the rubbed pork leg. Continue cooking in medium heat until one side becomes crispy, and then cautiously flip the leg to crisp the other side. Note: Be extra careful in doing this procedure.",
                "Turn-off the heat; remove the crispy pork leg; and transfer it to a wide serving plate.",
                "Serve with atcharang papaya and soy sauce – vinegar dipping sauce."
            ],
            "descr": "FILIPINO"
        },
        {
            "recipeId": 33,
            "name": "Leche Flan",
            "ingredients": [
                "Sugar",
                "10 eggs",
                "limes",
                "Condensed Milk",
                "Evaporated Milk",
                "Cream",
                "Water",
                "caramel"
            ],
            "directions": [
                "Preheat oven to 350 degrees Fahrenheit",
                "Fill small pan with sugar and continuously stir until caramelized",
                "Crack 10 eggs and use yolk only",
                "Add lime zest",
                "Use stand mixer on low setting",
                "Mix condensed milk and evaporated milk",
                "mix cream and use evaporated milk can and fill to 3 / 4th can",
                "get pan and put water enough to place flan mixture",
                "cook 45 minutes to an hour"
            ],
            "descr": "FILIPINO"
        },
        {
            "recipeId": 44,
            "name": "Waffles",
            "ingredients": [
                "1 3/4 cups milk",
                "2 eggs ",
                "2 cups all-purpose flour",
                "1/4 cup granulated sugar",
                "1/4 tsp salt ",
                "1/2 cup of vegetable oil",
                "4 Tbsp baking powder ",
                "2 Tbsp melted butter",
                "1 tbsp of vanilla extract",
                "2 1/2 tbsp of ground cinnamon"
            ],
            "directions": [
                "Whisk flour, white sugar, brown sugar, cinnamon, baking powder, and salt together in a bowl until no lumps remain.",
                "Pour milk, vegetable oil, and vanilla extract into the flour mixture; stir until just combined.",
                "Beat egg whites until foamy in a large glass or metal mixing bowl until soft peaks form. Lift your beater or whisk straight up: the egg whites will form soft mounds rather than a sharp peak.",
                "Fold the the beaten egg whites into the batter.",
                "Preheat a waffle iron and coat with cooking spray.",
                "Pour batter onto waffle iron in batches and cook until crisp and golden brown, about 2 minutes; repeat until all batter is used."
            ],
            "descr": "BARBEQUE"
        },
        {
            "recipeId": 34,
            "name": "Pandesal",
            "ingredients": [
                "¼ cup warm water",
                "1 (1/4 ounce) package active dry yeast",
                "1 cup lukewarm milk",
                "2 ounces butter, room temperature",
                "2 eggs, beaten",
                "½ cup sugar",
                "1-1/2 teaspoons salt",
                "4 1/4 cups flour and ¼ to ½ cup more for kneading",
                "1/2 cup fine breadcrumbs"
            ],
            "directions": [
                "In a large bowl,, combine water and yeast. Allow to sit for 10 minutes until mixture becomes bubbly. Stir well.",
                "In a small bowl, combine milk, butter, eggs, sugar and salt. Stir together until incorporated.",
                "Add milk mixture and 2 cups flour to yeast mixture. Using an electric mixer, beat to combine. Gradually add theremaining 2-1/4 cup flour in ½ cup increments and continue to combine all ingredients.",
                "On a lightlyfloured surface, turn over dough and knead, lightly adding flour as necessary, for about 10 minutes or until smooth, supple and elastic.",
                "In a lightlyoiled large bowl, place dough. Cover with film and allow to rise for about 1 to 1-1/2 hours or until double in size.",
                "On a lightlyfloured surface, transfer dough and divide into 24 pieces. Shape each piece into a ball and roll on breadcrumbs to coat. Arrange balls about 1inch apart on a lightlygreased baking sheet. ",
                "Cover with a cloth and allow to rise for about 1 to 1-1/2 hours or until double in size.",
                "Bake in a 350 F oven for about 15 to 20 minutes or until golden brown. Serve hot."
            ],
            "descr": "FILIPINO"
        },
        {
            "recipeId": 35,
            "name": "Pork Sinigang",
            "ingredients": [
                "Pork",
                "Onion",
                "Tomato",
                "Lemons (about 4 - 5",
                "Okra (box of frozen whole)",
                "Eggplant",
                "Green beans (about 1/4 pound)"
            ],
            "directions": [
                "Cover pork with water in pot",
                "Add salt",
                "Peel onion and cut into quarters and place into pot",
                "Chop tomato and place in pot.",
                "Cut lemons in half and squeeze lemon into pot. (strain so you don’t add seeds)",
                "Let boil about 40 minutes",
                "Meanwhile clean beans by cutting ends",
                "Cut eggplant into 8",
                "Add beans, okra and eggplant. Let boil for about 15 minutes."
            ],
            "descr": "FILIPINO"
        },
        {
            "recipeId": 36,
            "name": "Adobo",
            "ingredients": [
                "Chicken/Pork",
                "Soy Sauce",
                "Vinegar",
                "Onion",
                "Garlic",
                "Black Pepper"
            ],
            "directions": [
                "Rinse meat and place in pot with cover",
                "Add three cook  spoons of soy sauce",
                "Slice an onion and place in pot",
                "Smash and mince several cloves of garlic and put in pot",
                "Sprinkle some crushed black pepper",
                "cover and allow to boil",
                "turn down heat and allow to simmer for about 30 minutes"
            ],
            "descr": "FILIPINO"
        },
        {
            "recipeId": 37,
            "name": "Beefaroni",
            "ingredients": [
                "Marinara Sauce",
                "Meat",
                "Elbow Macaroni"
            ],
            "directions": [
                "make the marinara sauce and add the meat as described above.  ",
                "Let it simmer while you cook the macaroni.  ",
                "After macaroni is cooked, drain and rinse with cold water.  ",
                "Put the macaroni in a 9x12 pan.  Pour the meat sauce mixture over the macaroni, ",
                "sprinkle with parmesan cheese and then place slices of mozzarella cheese on top to cover the mix.",
                "Bake at 350 until the cheese is melted."
            ],
            "descr": "COMFORT FOOD"
        },
        {
            "recipeId": 38,
            "name": "Beef Stew - Red Sauce",
            "ingredients": [
                "Beef Chuck",
                "Tomato",
                "Carrots",
                "Celery",
                "Green Pepper",
                "Onion"
            ],
            "directions": [
                "Chop onion",
                "Slice beef into small slices",
                "Add beef",
                "Add nature's seasoning and allow beef to brown",
                "Chop tomato and place into pot",
                "Cut celery into small pieces and add to pot",
                "Cut pepper into small  pieces and place in pot",
                "Cover and allow tosimme until  carots are soft",
                "can eat as is or over rice"
            ],
            "descr": "COMFORT FOOD"
        },
        {
            "recipeId": 39,
            "name": "Beef Stew - Brown Sauce",
            "ingredients": [
                "Beef Chuck",
                "Tomato",
                "Carrots",
                "Celery",
                "Green Pepper",
                "Onion",
                "Brown gravy mix"
            ],
            "directions": [
                "slice beef chuck into small cubes",
                "chop onion",
                "peel potatoes and carrots. slice into bit sized pieces",
                "slice celery into bit sized pieces",
                "place onion in pot with oil and saute the onion",
                "add cubedbeef and allow to browm",
                "add nature's seasoning",
                "add potatoes, carrots, and celery",
                "place contents of brown gravy mix into a glass and add water",
                "mix and add to pot",
                "allow to simmer until carrots are soft",
                "serve as is or with rice"
            ],
            "descr": "COMFORT FOOD"
        },
        {
            "recipeId": 40,
            "name": "Chicken Noodle Soup",
            "ingredients": [
                "1 chopped onion",
                "3 chopped carrots",
                "3 chopped celery stalks",
                "3 minced garlic ",
                "3 boneless chicken breasts",
                "chicken broth",
                "1 bay leaf",
                "salt and pepper",
                "egg noodles",
                "fresh parsley"
            ],
            "directions": [
                "In your slow cooker, combine 1 chopped onion, 3 chopped carrots, 3 chopped celery stalks, 3 minced garlic cloves and 3 boneless, skinless chicken breasts that have been cut into ½-inch cubes.",
                "Add 5½ cups chicken broth and 1 bay leaf; season with salt and pepper.",
                "3 chopped celery stalks",
                "Cook on low for 6 hours.",
                "Add 2½ cups egg noodles and 1 cup frozen peas",
                "Cook until the noodles are tender, 6 to 7 minutes.",
                "Stir in ¼ cup chopped fresh parsley. Serve immediately."
            ],
            "descr": "COMFORT FOOD"
        },
        {
            "recipeId": 41,
            "name": "Chili",
            "ingredients": [
                "Garlic",
                "Onion",
                "Ground beef",
                "Nature's seasoning",
                "Chili powder",
                "Red pepper flakes",
                "Crushed Cayenne Pepper",
                "Can crushed tomatoes",
                "2-3 cans of dark red kidney beans"
            ],
            "directions": [
                "Mince garlic",
                "Chop onion",
                "In pot, place a little of oil and saute garlic and onion",
                "Put in ground beef, and allow to brown. Mix frequently to break up the champs of the ground beef",
                "Drain off some of the liquid",
                "Add in nature's seasoning,  chili powder, red pepper flakes, and crushed cayenne pepper to taste.",
                "Drain the liquid from the cans of kidney beans and then add beans only to the pot",
                "Stir in the crushed tomatoes",
                "3/4 fill the crushed tomatoes can with water and swirl. Add to pot and stir to mix",
                "Allow to simmer. Can eat as is or served with rice"
            ],
            "descr": "COMFORT FOOD"
        },
        {
            "recipeId": 42,
            "name": "Buttermilk French Toast",
            "ingredients": [
                "1 1/2 cups well-shaken buttermilk",
                "4 large eggs",
                "3 tablespoons sugar",
                "1 medium onion, chopped",
                "1/4 teaspoon salt",
                "12 (1/2-inch-thick) slices challah (from a 1-pound loaf; not end slices)",
                "4 1/2 tablespoons unsalted butter, divided"
            ],
            "directions": [
                "Preheat oven to 200°F.",
                "Whisk together buttermilk, eggs, sugar, and salt in a bowl. Pour into a large 4-sided sheet pan, then add bread in 1 layer and soak, turning occasionally, until bread has absorbed all liquid but is not falling apart, about 20 minutes.",
                "Heat 1 1/2 tablespoon butter in a 12-inch nonstick skillet over medium-high heat until foam subsides. Transfer 4 bread slices with a slotted spatula to skillet and cook, turning once, until slightly puffed and golden brown, about 3 minutes total.",
                "Transfer to a large shallow baking pan and keep warm in oven. Cook remaining bread in 2 batches, adding 1 1/2 tablespoon butter between batches."
            ],
            "descr": "BARBEQUE"
        },
        {
            "recipeId": 43,
            "name": "Pancakes",
            "ingredients": [
                "1.5 (386g) cups milk ",
                "1 egg ",
                "2 cups (300g) all-purpose flour ",
                "1/4 cup (62g) granulated sugar",
                "1 tsp (4g) salt ",
                "1/4 tsp (1g) baking soda ",
                "1 Tbsp (12g) baking powder ",
                "2 (21g) Tbsp melted butter",
                "2 tbsp of vanilla extract",
                "1 tbsp of ground cinnamon"
            ],
            "directions": [
                "In a small bowl, whisk together egg and milk.",
                "In a separate bowl, whisk and combine all-purpose flour with granulated sugar, salt, baking soda, and baking powder.",
                "Mix the dry ingredients with the wet ingredients while constantly whisking. ",
                "While whisking add in melted unsalted butter. Whisk until combined. Rest for 5 minutes.",
                "Preheat a nonstick skillet over medium. Spray with spray oil or unsalted butter.",
                "Once hot spoon ¼” dollops of the pancake batter. Cook for 2-3 minutes or until golden brown on the bottom. ",
                "Flip and cook for an additional 2-3 minutes. Repeat with the rest of the batter. ",
                "Top with butter and drizzle with maple syrup to serve."
            ],
            "descr": "BARBEQUE"
        },
        {
            "recipeId": 45,
            "name": "Egg Fu Yung Recipe",
            "ingredients": [
                "egetable oil, as needed",
                " shallots, thinly sliced",
                " green pepper, seeded and diced",
                " celery stalk, chopped",
                " garlic cloves, minced",
                " cup bean sprouts",
                "oz ﴾115g﴿ small shrimp, peeled and deveined",
                " eggs, beaten",
                "/4 cup vegetable stock",
                " tbsp oyster sauce",
                " tbsp soy sauce",
                " tbsp Chinese red wine / sherry wine",
                " tsp corn starch",
                "ice to servce"
            ],
            "directions": [
                "Heat 2 tbsp oil in a wok over high heat. Add the shallots, bell pepper, celery, and garlic and stir‐fry for 3 minutes. Add the bean sprouts, stir‐fry for 1 minute, then add the shrimp and stir‐fry for 1 minute, or until the shrimp turn pink. Transfer to a bowl and let cool.",
                "Add the beaten eggs, stirring until well combined. Wash the wok and wipe dry with paper towels",
                "Return the wok to high heat and pour in 2in ﴾5cm﴿ oil.When the oil is hot, ladle 1/4 of the mixture into the oil. Fry about 2 minutes, until the underside is lightly browned, spooning a little of the hot oil over the eggs so the top starts to set.",
                "Carefully turn the egg cake over and cook 1 minute, until lightly browned on the other side. Transfer to paper towels to drain. Keep warm in a 200°F ﴾95°C﴿ oven while making the remaining cakes.",
                "Meanwhile, mix the stock, oyster sauce, soy sauce, and rice wine in a saucepan. Dissolve the cornstarch in 2 tbsp cold water, and stir into the stock mixture. Bring to a boil over high heat, stirring constantly until thickened; simmer for 1 minute. Serve the cakes with the sauce and rice."
            ],
            "descr": "ASIAN"
        },
        {
            "recipeId": 46,
            "name": "Pad Thai",
            "ingredients": [
                "Large package of chicken/beef",
                "Shrimp",
                "package of savory tofu",
                "3 eggs",
                "egg noodles",
                "Nature's seasoning",
                "Liquid Tamarin",
                "green onions",
                "onion sprouts"
            ],
            "directions": [
                "Chop onion",
                "Chop green pepper",
                "In mixing bowl place ground beef, half of the chopped onion, half of the chopped green pepper, 2 eggs, nature’s seasoning and mix well",
                "Divide mixture in half and form loaf. Repeat with other half",
                "Place in fry pan and brown all sides",
                "When browning last side, add onions to pan to cook",
                "Add green  pepper and allow to cook for about a minute or two.",
                "Pour crushed tomatoes over loaves",
                "3/4 fill empty can with water, swirl and pour into fry pan",
                "Let simmer for about 45 minutes"
            ],
            "descr": "ASIAN"
        },
        {
            "recipeId": 47,
            "name": "Peking Style Porkchops",
            "ingredients": [
                "Large package of pork tenderloin / pork spare ribs",
                "Vegetable / Canola Oil",
                "1 teaspoon of toasted sesame seeds, OPTIONAL",
                "2 eggs",
                "1 tablespoon corn starch",
                "Nature's seasoning",
                "1/2 teaspoon salt",
                "1.5 tablespoons tomato ketchup",
                "1/2 tablespoon plum sauce",
                "1/2 tablespoon chili sauce",
                "1/4 teapsoon hoisin sauce",
                "1 tablespoon Worchestershire sauce",
                "1 1/2 table spoons of sugar",
                "2 tablespoons of water"
            ],
            "directions": [
                "Pound pork slices with mallet, or with the back of a kitchen knife until tender. Set aside. In a bowl, mix the Marinade ingredients, add in pork slices, mix well, and marinade for 30 minutes.",
                "In a separate bowl, mix the Sauce ingredients. You may add more or less sugar, or other sauce ingredients to your own liking. Set sauce mixture aside.",
                "Heat up a wok with enough oil, deep-fry pork slices for 5 minutes, or until color changes to golden brown and slightly crispy. Dish up, drain with paper towels and set aside.",
                "Bring sauce to a quick boil, add deep-fried pork, and stir until all the meat is well coated with sauce. Dish up and sprinkle the pork chops with some toasted sesame seeds. Serve over a bowl of hot steamed rice."
            ],
            "descr": "ASIAN"
        },
        {
            "recipeId": 48,
            "name": "Wonton Soup",
            "ingredients": [
                "8 cups low sodium chicken broth",
                "¼ cup low sodium soy sauce",
                "3 tbsp rice vinegar",
                "1 tbsp fresh ginger, minced",
                "1 tbsp sesame oil",
                "1/2 tbsp sambal oelek",
                "A bunch of potstickers",
                "8oz mushrooms, sliced",
                "6oz raw baby spinach",
                "rice noodles, 1 package (whatever you want, I don't care)"
            ],
            "directions": [
                "In a large pot over high heat, bring chicken broth, soy sauce, rice vinegar, ginger, sesame oil and sambal oelek to a boil, stirring occasionally.",
                "One boiling, add frozen dumplings/potstickers, mushrooms, and baby spinach to the boiling broth and simmer for 35 minutes until dumplings are warmed through and spinach is wilted and mushrooms are tender.",
                "Divide noodles between four bowls and cover with equal parts of the wonton soup."
            ],
            "descr": "ASIAN"
        },
        {
            "recipeId": 49,
            "name": "Pineapple Upside Down Cake",
            "ingredients": [
                "1/2 Cup butter (1 stick), melted",
                "1/2 Cup packed brown sugar",
                "1 Can pineapple rings in 100% juice (reserve the juice)",
                "1 Jar maraschino cherries",
                "1 Box yellow or pineapple cake mix",
                "1 4-serving box instant vanilla pudding",
                "3 eggs",
                "vegetable oil",
                "milk"
            ],
            "directions": [
                "Preheat the oven to 350 degrees F.",
                "Prepare the bundt pan by generously applying pan release (recipe below) or non-stick spray.",
                "Melt the butter and evenly pour into the bottom of the pan. Sprinkle with the brown sugar. Cut the pineapple rings in half and alternate with the maraschino cherries around the bundt pan",
                "In a stand mixer or large bowl, stir the cake mix and pudding mix together. Drain the pineapple juice into a measuring cup and add enough milk to make 1 Cup of liquid. ",
                "Add this with the eggs and the amount of oil called for in the recipe to the cake mixture; following the instructions on the box.",
                "Carefully pour the batter over the fruit and bake as instructed for a bundt cake. The cake is done when an inserted knife comes out clean. Cool for 10 minutes in the pan. Slide a knife around the edges including the inner ring.",
                "Invert the cake onto a serving plate. Slice between the pineapple rings and serve warm or room temperature. Best Ever Pan Release: from I Am Baker",
                "Mix equal parts of vegetable shortening, vegetable oil, and all-purpose flour until smooth. Using a pastry brush or paper towel, apply to the pans paying special attention to corners, nooks, and crannies."
            ],
            "descr": "DESERTS"
        },
        {
            "recipeId": 50,
            "name": "Red Velvet Cake",
            "ingredients": [
                "2 2/3 cups (400 g) plain cake flour",
                "2 tbsp (10 g) cocoa powder , unsweetened",
                "1 tsp (5 g) baking soda / bi-carb soda , NOT baking powder (Note 2)",
                "Pinch of salt",
                " 1/2 cup (115 g) unsalted butter ",
                "1 1/2 cups (330 g) caster / superfine white sugar ",
                "2 eggs",
                "1 cup (250ml) vegetable oil",
                "1 tsp white vinegar",
                "2 tsp vanilla extract (or essence)",
                "1 cup (250 ml) buttermilk , at room temperature (Note 4)",
                "2 1/2 tbsp red food colouring liquid (UK: use Gel, Note 7)",
                "g) Philadelphia Cream Cheese, block , softened but not too soft",
                "1/2 cup (115 g) unsalted butter , softened (but not too soft)",
                "1 1/2 tsp vanilla extract",
                "4 cups (450 g) soft icing sugar / powdered sugar"
            ],
            "directions": [
                "Preheat oven to 180C/350F (all oven types). Butter 2 x 21cm / 8″ round cake pans (sides and base) and dust with cocoa powder.",
                "Sift the Dry Ingredients and whisk to combine in a bowl.",
                "Place butter and sugar in a bowl and beat with electric beater or in stand mixer until smooth and well combined (use paddle",
                "Add eggs, one at a time, beating in between to combine. At first it will look curdle – keep beating until it’s smooth.",
                "Add vegetable oil, vinegar, vanilla, buttermilk and red food colouring. Beat until combined and smooth (Note 5).",
                "Add Dry Ingredients. Beat until just combined – some small lumps is ok, that’s better than over mixing.",
                "Divide batter between cake pans. Bake for 25 – 30 minutes on the same shelf, or until a toothpick inserted into the centre comes out clean. (Note 6)",
                "Rest for 10 minutes in the pan then turn out onto a cooling rack and allow to cool."
            ],
            "descr": "DESERTS"
        }
    ]
}